# FabricationHostedInfo Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationHostedInfo Class
Members See Also
---
The fabrication hosted element information.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class FabricationHostedInfo : IDisposable
```

Visual Basic
---
```text
Public Class FabricationHostedInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FabricationHostedInfo : IDisposable
```

# Remarks
A fabrication part may have a host, the FabricationHostedInfo stores the host information for the fabrication part.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FabricationHostedInfo
# See Also
FabricationHostedInfo Members
Autodesk.Revit.DB Namespace